--
-- テーブルの構造 `t_buymemo`
--

CREATE TABLE `t_buymemo`
(
  `id` int(10) NOT NULL COMMENT '増長ID',
  `card_id` bigint(13) NOT NULL COMMENT '顧客ID',
  `memo` varchar(300) CHARACTER SET utf8mb4 NOT NULL COMMENT 'メモ内容',
  `jan` varchar(20) DEFAULT NULL,
  `quantity` int(2) NOT NULL COMMENT '購買数量',
  `detail` varchar(300) CHARACTER SET utf8 DEFAULT NULL COMMENT 'メモ詳細',
  `chkflag` bit(1) NOT NULL DEFAULT b'0' COMMENT '購買フラグ 0:未 1:済',
  `sort_id` int(3) NOT NULL DEFAULT 1 COMMENT '排序id	',
  `create_date` datetime NOT NULL COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COMMENT='買物メモ用テーブル';

--
-- テーブルのデータのダンプ `t_buymemo`
--

INSERT INTO `t_buymemo` (`id`, `card_id`, `memo`, `jan`, `quantity`, `detail`, `chkflag`, `sort_id`, `create_date`) VALUES
(48, 2999000001323, 'い', '', 1, '', b'1', 9, '2020-10-08 11:37:21'),
(49, 2999000001323, 'た', '', 1, '', b'1', 8, '2020-10-08 11:36:47'),
(50, 2999000001323, 'た', '', 1, '', b'0', 1, '2020-08-18 09:25:04'),
(304, 2999000001354, 'アクエリアス2L', '4902102113724', 1, '', b'1', 1, '2020-08-24 12:08:28'),
(306, 2999000001347, '111', '', 1, '222', b'0', 1, '2020-08-24 15:59:41'),
(307, 2999000001811, 'fhっっk', '', 1, 'っじKBヴェルミチェッリ', b'1', 4, '2020-08-25 14:07:38'),
(308, 2999000011148, '我们一起', '', 1, '不能因为我', b'0', 1, '2020-08-26 14:07:17'),
(309, 2999000011148, '不过现在也', '', 1, '一次就够我用我所有时间和地点和他们在一起玩游戏吧。我要把他当成朋友说他在她心中都有希望才努力奋斗……这里有好多东西没看到短信打电话说你要好好看看人家说什么好方法？这种现象已经成为全球的市场竞争和着竞争优势是最关键技术人员了？不会在任何事情方面想的是因为没有你要走到你心里没有你了。在下自己慢慢学会发现很多的时候都是一片黑暗。不会是什么事了。一次是在我们面前设置了权限管理有限公司董事长兼首席执行官兼总裁班的第一天开始额的问题。我特聘副教授以上的领导地位与领导地位也不断上升……这些人怎么了。我说过一句生日的话也没有', b'0', 2, '2020-08-26 14:08:13'),
(310, 2999000011148, '你说了没钱我还能给她吗。不过还是挺期待已久会很想要一起去看的太开心辣。我说了句再见再见是再也不见，你也不要了。我说了一年就这样过去了。我想去的路上。在乎的是你在一起时会觉得不爱吃', '', 1, '你就说你不懂为什么有人会在这句祝福你新年新生活新体验。这么好看这么大就坐不下来。你不想再这样子我才知道是因为不知道是我自己去买什么的都是幸福吧？我想去你的？我的世界观的结局太大就不要', b'0', 3, '2020-08-26 14:08:56'),
(314, 2999000007042, '本麒麟350ml　6缶', '4901411083520', 1, '', b'0', 16, '2020-09-30 16:07:31'),
(317, 2999000007042, '角瓶', '4901777284289', 1, '', b'1', 24, '2020-10-05 14:37:27'),
(318, 2999000007042, '角瓶', '4901777284289', 1, '', b'0', 14, '2020-09-30 16:07:28'),
(319, 2999000007042, '味ね', '', 1, '', b'0', 13, '2020-09-30 16:07:26'),
(325, 2999000007042, 'ザ・プレミアム・モルツ　350ml缶', '4901777302204', 9, '', b'0', 25, '2020-10-05 14:37:30'),
(386, 2999000009848, 'パインアメラムネ', '4902435016440', 1, '', b'0', 4, '2020-08-28 14:15:57'),
(387, 2999000009848, '生おろしわさび', '4930129461122', 1, '', b'1', 8, '2020-09-28 13:49:02'),
(389, 2999000009848, 'テスト', '', 1, '', b'0', 3, '2020-08-28 14:33:34'),
(390, 2999000009848, 'PB緑茶2L', '4522646702859', 1, '', b'0', 2, '2020-08-28 14:46:03'),
(391, 2999000009848, '大粒ラムネ', '4902888232374', 1, '', b'0', 5, '2020-08-28 14:46:03'),
(411, 2999000001385, 'ピクニック_コーヒー', '4902720058124', 1, '', b'0', 1, '2020-08-28 15:38:58'),
(413, 2999000001385, 'ソイジョイ　3種のレーズン', '4987035573814', 1, '', b'0', 5, '2020-08-28 15:38:58'),
(425, 2999000001385, '大粒ラムネ', '4902888232374', 1, '', b'0', 3, '2020-08-28 16:38:25'),
(426, 2999000001385, '白いやわらかこっぺ（つぶあんとマーガリン）', '4951595701925', 1, '', b'0', 2, '2020-08-28 16:38:25'),
(427, 2999000001385, '銀チョコクロワッサン', '4902410519119', 1, '', b'0', 4, '2020-08-28 16:38:25'),
(428, 2999000009787, 'test', '', 1, '', b'0', 1, '2020-08-28 16:41:40'),
(429, 2999000009787, 'test', '', 1, '', b'0', 2, '2020-08-28 16:41:47'),
(430, 2999000009787, 'testq', '', 1, '', b'0', 3, '2020-08-28 16:41:53'),
(431, 2999000009848, 'シーチキンＮｅｗマイルド', '4902560020749', 2, '', b'0', 6, '2020-08-28 17:28:12'),
(432, 2999000009848, 'えいshdhsj', '', 1, 'っっっwっっっdっっっっっfっっg', b'0', 7, '2020-08-28 17:39:22'),
(462, 2999000002320, '食パン', '', 1, '', b'1', 2, '2020-09-21 11:28:35'),
(465, 2999000009787, '一番搾り350ml6缶ﾊﾟｯｸ', '4901411157719', 1, '', b'1', 9, '2020-09-09 18:05:42'),
(466, 2999000001767, 'フライドチキン', '2510689000997', 2, '', b'0', 4, '2020-09-08 15:05:21'),
(467, 2999000001767, 'ウイダーinゼリー_プロテイン', '4902888723957', 1, '', b'0', 2, '2020-09-08 15:05:15'),
(468, 2999000009787, 'レモンサワーの素', '4901777317475', 1, '', b'0', 5, '2020-09-09 18:04:28'),
(469, 2999000009787, '午後の紅茶　おいしい無糖_500ml', '4909411080891', 1, '', b'0', 8, '2020-09-09 18:05:29'),
(470, 2999000002320, '人参入りＭＩＸごぼう', '4535093003028', 8, '', b'0', 3, '2020-09-30 10:20:42'),
(471, 2999000009787, '凤凰机场', '', 1, '对方拒绝', b'0', 10, '2020-09-30 12:23:53'),
(472, 2999000001323, 'trr', '', 1, '', b'0', 4, '2020-09-30 13:36:02'),
(473, 2999000009787, 'qw', '', 1, 'っうぇ', b'0', 11, '2020-09-30 14:37:01'),
(474, 2999000007042, 'たたたたた', '', 1, 'たたたたたたたたたた', b'0', 17, '2020-10-02 13:13:49'),
(475, 2999000007042, '午後の紅茶　おいしい無糖_500ml', '4909411080891', 1, 'なんてこった', b'0', 20, '2020-10-02 13:21:34'),
(476, 2999000007042, '大粒ラムネ', '4902888232374', 1, '', b'0', 21, '2020-10-02 14:21:28'),
(478, 2999000001330, 'ffffee', '', 1, '', b'1', 1, '2020-10-05 10:41:02'),
(479, 2999000001323, 'ああ', '', 1, '', b'0', 10, '2020-10-08 11:37:39'),
(480, 2999000001323, 'たいやき', '', 1, '', b'0', 11, '2020-10-08 11:37:51');

--
-- テーブルのインデックス `t_buymemo`
--
ALTER TABLE `t_buymemo`
  ADD UNIQUE KEY `idx_id` (`id`);

--
-- テーブルのAUTO_INCREMENT `t_buymemo`
--
ALTER TABLE `t_buymemo`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '増長ID', AUTO_INCREMENT=483;
